<?php
return [
    'system' => [
        'roles' => [1, 2], // システム管理者・事務
        'menus' => ['部署', '権限', '講座開催者', '講座種類', '講座分野', '技術分類タグ', 'お知らせカテゴリ', 'カテゴリ', '今日の一言', '今日の一言（悪魔合体）', '表示テーマ']
    ],
    'user' => [
        'roles' => [1, 2, 3, 4], // システム管理者、事務、講師、パート
        'menus' => ['受講者一覧', 'スタッフ一覧']
    ],
    'course' => [
        'roles' => [1, 2, 3, 4],
        'menus' => ['講座一覧', '講座・カテゴリ', '講座・講師', '講座・受講者', '日報管理', '質疑応答']
    ],
    'agenda' => [
        'roles' => [1, 2, 3, 4],
        'menus' => ['アジェンダ一覧', 'アジェンダ登録', 'アジェンダ・ファイル', '講座アジェンダ']
    ],
    'media' => [
        'roles' => [1, 2, 3],
        'menus' => ['メディア一覧', 'メディア登録']
    ],
    'info' => [
        'roles' => [1, 2, 3],
        'menus' => ['お知らせ一覧', 'お知らせ投稿', 'お知らせ・ファイル']
    ],
    'support' => [
        'roles' => [1, 2, 3],
        'menus' => ['資格情報', '参考コンテンツ', '就職支援']
    ],
    'quiz' => [
        'roles' => [1, 2, 3],
        'menus' => ['クイズ一覧', 'クイズ登録']
    ],
    'other' => [
        'roles' => [1, 2, 3],
        'menus' => ['実績管理', '実績解除管理']
    ],
];
